{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "output_dim": 100, "trainable": true, "embeddings_constraint": null, "input_dim": 34, "activity_regularizer": null, "embeddings_regularizer": null, "name": "embedding_1", "input_length": 11, "dtype": "float32", "batch_input_shape": [null, 11], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}}}, {"class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_1", "seed": null, "noise_shape": null, "rate": 0.2, "trainable": true}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activation": "tanh", "implementation": 1, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "recurrent_regularizer": null, "bias_constraint": null, "unit_forget_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "stateful": false, "recurrent_constraint": null, "units": 64, "go_backwards": false, "batch_input_shape": [null, 11, 100], "activity_regularizer": null, "recurrent_dropout": 0.2, "name": "lstm_1", "return_sequences": false, "recurrent_activation": "hard_sigmoid", "dropout": 0.2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null}}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1", "activation": "softmax", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null}}], "keras_version": "2.2.2", "backend": "tensorflow"}